Public Attributes | List of all members
API_LayerStat Struct Reference
Attribute Management
Describes one layer's characteristics in a layer combination. More...
#include <APIdefs_Attributes.h>
 Public Attributes
 short  | lFlags
Status of the layer (see APILay_...).
 Int32  | conClassId
Connection class of the layer; elements on layers having the same class will be intersected.
Detailed Description
Describes one layer's characteristics in a layer combination.
Remarks
The layer combination attribute contains all the visibility and locking information for each layer. This structure describes the characteristics of one layer in the layer combination.